#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_compute_instance_v2.cloud-info: Refreshing state... [id=8bb09920-daf2-4bd1-bd53-8fc1a245a869]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_instance_v2.cloud-info must be replaced
-/+ resource "openstack_compute_instance_v2" "cloud-info" {
      ~ access_ip_v4        = "192.168.1.121" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ created             = "2022-12-15 12:14:38 +0000 UTC" -> (known after apply)
      ~ flavor_name         = "svc1.m" -> (known after apply)
      ~ id                  = "8bb09920-daf2-4bd1-bd53-8fc1a245a869" -> (known after apply)
      ~ image_name          = "ubuntu-18.04-amd64-raw" -> (known after apply)
        name                = "cloud-info"
      + region              = (known after apply)
      ~ security_groups     = [
          - "ssh - open",
            # (1 unchanged element hidden)
        ]
      - tags                = [] -> null
      ~ updated             = "2022-12-15 12:28:26 +0000 UTC" -> (known after apply)
      ~ user_data           = "1f0226e93ffae4dd00f871742c6eeb86d5a144f0" -> "3b14c8f5bc3329f09546d91d7aaad0af16ce5246" # forces replacement
        # (5 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.1.121" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:6b:ba:9c" -> (known after apply)
          ~ name           = "cloud_egi_net" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*